% ******************************* 遗传算法矩阵编码 ****************************
% *******************************     作者 王飞平   *****************************
% ******************************* 始于2015年12月22日 *************************

clc ; clear all;
global pop;         %种群的变量(全局变量)
popsize = 40;      %种群规模
row = 8;
col = 8;
pop = InitialPop(8,8,popsize);    %Initial pop first ok
[obj , maxobj, average] = Objfunc(pop);

%初代种群的适应度分布图
figure(1);
x = 1:popsize;
y = obj;
plot(x,y,'*');
title('初代种群的适应度分布图');
  
   